--------------------------------------------------------------------------------------------------------------------------
-- Если добавляется новы экземпляр книги, то в таблице КНИГА количеств экземпляров увеличивается на +1:		+			--
--------------------------------------------------------------------------------------------------------------------------
	CREATE TRIGGER Add_Instances ON Instances
	AFTER INSERT
	AS

	DECLARE @ISBN nchar(13)
	
	SELECT @ISBN = ISBN FROM INSERTED
	
	UPDATE Books  
	SET number = number + 1
	WHERE ISBN = @ISBN