--------------------------------------------------------------------------------------------------------------------------
--	Проверки наличия экземпляров заданной книги в библиотеке (процедура должна возвращать количество экземпляров книги).--
--------------------------------------------------------------------------------------------------------------------------
	CREATE PROC Count_Instances (@name nchar(50))
	AS
		SELECT COUNT(*) AS "Количество экземпляров"
		FROM  Books INNER JOIN Instances ON Books.ISBN = Instances.ISBN
		WHERE Books.name = @name AND existence = 'да'


EXEC Count_Instances @name = 'Модели данных и СУБД';